N = int(input())

# N = 1
# 1
# 1개

# N = 2
# 00, 11
# 2개

# N = 3
# 001, 100, 111
# 3개

# N = 4
# 0000, 0011, 1001, 1100, 1111
# 5개

# N = 5
# 00001, 00100, 10000, 00111, 10011, 11001, 11100, 11111
# 8개

# N = 6
# 000000, 000011, 001001, 001100, 100001, 100100, 110000, 001111, 100111, 110011, 111001, 111100, 111111
# 13개
        
# N = N
# numbers[N] = ('1' +  numbers[N-1]) + ('00' + numbers[N-2])
#          또는 (numbers[N-1] + '1') + (numbers[N-2] + '00')
#             * numbers[N-1] + '1' = ( (numbers[N-2] + '1') + (numbers[N-3] + '00') ) + '1'
        
numbers = [0, 1, 2]
for i in range(1, N+1):
    if i == 1 or i == 2:
        continue
    # numbers.append(numbers[-1] + numbers[-2])
    # 위에 거 쓰면 나중에 숫자가 너무 커져서 메모리 초과 남
    numbers.append((numbers[-1] + numbers[-2]) % 15746)
    # 더하고 나머지 구하는 거 = 나머지 구하고 나머지끼리 더하는 거
    
print(numbers[N])